Repository: AlexKingAx/file-media-renamer-for-seo
Catalog: languages/fmrseo-*.po
Languages: it_it

source: A file with the new name and the same file extension already exists. Change it or add a number!
it_it: Esiste già un file con il nuovo nome e la stessa estensione del file. Cambialo o aggiungi un numero!

source: Change image file name and path for better SEO
it_it: Cambia il nome del file immagine e il percorso per una migliore SEO

source: Configure the settings for File Media Renamer for SEO.
it_it: Configura le impostazioni per File Media Renamer per SEO.

source: Failed to rename the file.
it_it: Impossibile rinominare il file.

source: File and thumbnails renamed successfully.
it_it: File e miniature rinominati con successo.

source: File Media Renamer Settings
it_it: Impostazioni di File Media Renamer

source: File path not found.
it_it: Percorso del file non trovato.

source: FMR Settings
it_it: Impostazioni FMR

source: If enabled, the media alt text will also be renamed.
it_it: Se abilitato, il testo alternativo del media sarà anche rinominato.

source: If enabled, the media title will also be renamed.
it_it: Se abilitato, il titolo del media sarà anche rinominato.

source: Nonce verification failed.
it_it: Verifica del nonce fallita.

source: Original file does not exist.
it_it: Il file originale non esiste.

source: Rename Alt Text
it_it: Rinomina Alt Text

source: Rename Title
it_it: Rinomina Titolo

source: Save
it_it: Salva

source: Save SEO Name
it_it: Salva Nome SEO

source: SEO Name
it_it: Nome SEO

source: Settings Saved
it_it: Impostazioni Salvate

source: Rename
it_it: Rinomina

source: Rename Selected Media
it_it: Rinomina Media Selezionati

source: You have selected %d files to rename.
it_it: Hai selezionato %d file da rinominare.

source: Base name:
it_it: Nome base:

source: e.g: new-name
it_it: es: nuovo-nome

source: Files will be renamed as: new-name-1, new-name-2, etc.
it_it: I file saranno rinominati come: nuovo-nome-1, nuovo-nome-2, ecc.

source: Cancel
it_it: Annulla

source: Start Rename
it_it: Inizia Rinomina

source: Processing...
it_it: Elaborazione in corso...

source: Rename completed!
it_it: Rinomina completata!

source: Error during rename
it_it: Errore durante la rinomina

source: File renamed successfully
it_it: File rinominato con successo

source: Error renaming file
it_it: Errore nella rinomina del file

source: Security verification failed.
it_it: Verifica di sicurezza fallita.

source: Insufficient permissions.
it_it: Permessi insufficienti.

source: Missing parameters.
it_it: Parametri mancanti.

source: Base name can only contain letters, numbers, hyphens and underscores.
it_it: Il nome base può contenere solo lettere, numeri, trattini e underscore.

source: You can rename maximum 50 files at once.
it_it: Puoi rinominare massimo 50 file alla volta.

source: One or more IDs are not valid media files.
it_it: Uno o più ID non sono file media validi.

source: Please enter a base name for the files.
it_it: Inserisci un nome base per i file.

source: Are you sure you want to rename %d files?
it_it: Sei sicuro di voler rinominare %d file?

source: Close and Reload
it_it: Chiudi e Ricarica

source: Results:
it_it: Risultati:

source: Error:
it_it: Errore:

source: Simple and speedy plug-in for help your SEO
it_it: Plug-in semplice e veloce per aiutare il tuo SEO

source: AI Configuration
it_it: Configurazione AI

source: Enable AI Renaming
it_it: Abilita Rinomina AI

source: Enable AI-powered automatic media renaming functionality.
it_it: Abilita la funzionalità di rinomina automatica dei media basata su AI.

source: API Key
it_it: Chiave API

source: Enter your AI service API key for content analysis and name generation.
it_it: Inserisci la tua chiave API del servizio AI per l'analisi del contenuto e la generazione dei nomi.

source: Credit Balance
it_it: Saldo Crediti

source: Current available credits for AI operations.
it_it: Crediti attualmente disponibili per le operazioni AI.

source: API Timeout (seconds)
it_it: Timeout API (secondi)

source: Timeout for AI API requests in seconds (default: 30).
it_it: Timeout per le richieste API AI in secondi (predefinito: 30).

source: Max Retries
it_it: Tentativi Massimi

source: Maximum number of retry attempts for failed AI requests (default: 2).
it_it: Numero massimo di tentativi per le richieste AI fallite (predefinito: 2).

source: Configure AI-powered automatic media renaming settings. AI functionality requires a valid API key and sufficient credits.
it_it: Configura le impostazioni di rinomina automatica dei media basata su AI. La funzionalità AI richiede una chiave API valida e crediti sufficienti.

source: ✓ API Key is valid
it_it: ✓ La chiave API è valida

source: ✗ API Key validation failed
it_it: ✗ Validazione della chiave API fallita

source: Enter a valid API key to view credit balance.
it_it: Inserisci una chiave API valida per visualizzare il saldo crediti.

source: Available Credits: %d
it_it: Crediti Disponibili: %d

source: Total Credits Used: %d
it_it: Crediti Totali Utilizzati: %d

source: Unable to retrieve credit balance. Please check your API key.
it_it: Impossibile recuperare il saldo crediti. Controlla la tua chiave API.

source: Invalid API key. Please check your key and try again.
it_it: Rinomina con AI

source: Processing with AI...
it_it: Elaborazione con AI...

source: AI processing failed
it_it: Elaborazione AI fallita

source: Renamed successfully
it_it: Rinominato con successo

source: Insufficient credits
it_it: Crediti insufficienti

source: AI Rename Suggestions
it_it: Suggerimenti AI per Rinomina

source: Select a suggested name for your media file:
it_it: Seleziona un nome suggerito per il tuo file media:

source: Preview:
it_it: Anteprima:

source: Apply Rename
it_it: Applica Rinomina

source: Please select a suggestion
it_it: Seleziona un suggerimento

source: Applying...
it_it: Applicazione in corso...

source: Invalid media ID.
it_it: ID media non valido.

source: AI functionality is not enabled.
it_it: La funzionalità AI non è abilitata.

source: Insufficient credits for AI rename.
it_it: Crediti insufficienti per la rinomina AI.

source: Failed to generate AI suggestions.
it_it: Impossibile generare suggerimenti AI.

source: File renamed successfully with AI.
it_it: File rinominato con successo con AI.

source: File renamed using fallback method (AI unavailable).
it_it: File rinominato usando il metodo di fallback (AI non disponibile).
